[
  {
    "insight": "Your facial symmetry greatly enhances your overall attractiveness.",
    "ugly": 0
  },
  {
    "insight": "A bright and genuine smile adds charm to your appearance.",
    "ugly": 0
  },
  {
    "insight": "Well-defined facial features contribute to your attractive look.",
    "ugly": 0
  },
  {
    "insight": "Clear and radiant skin enhances your natural beauty.",
    "ugly": 0
  },
  {
    "insight": "Your confident posture boosts your attractiveness.",
    "ugly": 0
  },
  {
    "insight": "Expressive eyes draw attention and add allure to your face.",
    "ugly": 0
  },
  {
    "insight": "Your hairstyle complements your features, enhancing your attractiveness.",
    "ugly": 0
  },
  {
    "insight": "Subtle makeup enhances your features, accentuating your beauty.",
    "ugly": 0
  },
  {
    "insight": "Your fashion sense adds to your overall attractiveness.",
    "ugly": 0
  },
  {
    "insight": "The combination of your features creates a unique and attractive appearance.",
    "ugly": 0
  },
  {
    "insight": "Your positive energy radiates, making you more attractive to others.",
    "ugly": 0
  },
  {
    "insight": "Your sense of style enhances your overall attractiveness.",
    "ugly": 0
  },
  {
    "insight": "Your facial expressions convey warmth and approachability.",
    "ugly": 0
  },
  {
    "insight": "Your smile lights up your face, making you more attractive.",
    "ugly": 0
  },
  {
    "insight": "Your natural grace and elegance contribute to your attractiveness.",
    "ugly": 0
  },
  {
    "insight": "Your well-groomed appearance enhances your overall attractiveness.",
    "ugly": 0
  },
  {
    "insight": "Your confidence shines through, making you more attractive.",
    "ugly": 0
  },
  {
    "insight": "Your magnetic personality adds to your overall attractiveness.",
    "ugly": 0
  },
  {
    "insight": "Your genuine demeanor makes you more appealing to others.",
    "ugly": 0
  },
  {
    "insight": "Your inner beauty reflects in your outward appearance, making you more attractive.",
    "ugly": 0
  },
  {
    "insight": "True beauty is found within. Let your kindness and compassion shine brighter than any physical feature.",
    "ugly": 1
  },
  {
    "insight": "Remember, your worth is not defined by your appearance. Embrace your uniqueness and let your inner light illuminate the world.",
    "ugly": 1
  },
  {
    "insight": "Outer beauty fades, but inner beauty lasts a lifetime. Cultivate qualities that truly matter.",
    "ugly": 1
  },
  {
    "insight": "Beauty is not skin deep; it's about how you treat others and the impact you have on the world.",
    "ugly": 1
  },
  {
    "insight": "Your value lies in your character, not in your physical appearance. Focus on being a good person above all else.",
    "ugly": 1
  },
  {
    "insight": "Ugliness is only skin deep, but kindness goes straight to the heart. Let your actions reflect the beauty within.",
    "ugly": 1
  },
  {
    "insight": "Your worth is not determined by societal standards of beauty. You are valuable just the way you are.",
    "ugly": 1
  },
  {
    "insight": "Don't let a scan define your self-worth. Your beauty lies in your unique qualities and the love you share.",
    "ugly": 1
  },
  {
    "insight": "Beauty is subjective. What one considers ugly, another may find beautiful. Embrace your individuality.",
    "ugly": 1
  },
  {
    "insight": "Your true beauty lies in your authenticity and the way you make others feel. Let your inner radiance shine through.",
    "ugly": 1
  },
  {
    "insight": "Ugliness is a perception, not a reality. Focus on cultivating positivity and spreading joy.",
    "ugly": 1
  },
  {
    "insight": "Physical appearance is just one aspect of who you are. Your true beauty comes from your strength, resilience, and kindness.",
    "ugly": 1
  },
  {
    "insight": "The most beautiful people are those who uplift others and spread love wherever they go.",
    "ugly": 1
  },
  {
    "insight": "You are more than your reflection in a mirror. Your worth comes from your actions and the impact you make in the world.",
    "ugly": 1
  },
  {
    "insight": "Ugliness fades in comparison to the beauty of a kind heart and a generous spirit.",
    "ugly": 1
  },
  {
    "insight": "Beauty standards change, but kindness and empathy are timeless.",
    "ugly": 1
  },
  {
    "insight": "Don't let society's narrow definition of beauty define you. Embrace your unique features and celebrate your individuality.",
    "ugly": 1
  },
  {
    "insight": "There is beauty in imperfection. Embrace your flaws—they make you human, they make you real.",
    "ugly": 1
  },
  {
    "insight": "True beauty is found in acceptance—acceptance of yourself and acceptance of others just as they are.",
    "ugly": 1
  },
  {
    "insight": "You are beautiful in your own way. Don't let anyone else's perception dim your shine.",
    "ugly": 1
  }
]